import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../../tags";
import { Table, Col, Row } from "../../table";

export const ponyatie_ob_prilagatelnom = <View><P><Strong><Span className="number">1.</Span></Strong> <Strong>Имя прилагательное</Strong> &ndash; самостоятельная часть
    речи, которая обозначает признак предмета и отвечает на вопросы <Span className="litera">какой? чей?</Span></P>
<P>Основные признаки имени прилагательного</P>
    <Table>
        <Row>
            <Col><Span className="table_razdel3">А) Общее грамматическое значение</Span></Col>
            <Col><Span className="table_razdel3">Примеры</Span></Col>
        </Row>
        <Row>
            <Col>Это значение признака предмета:</Col>
            <Col>&nbsp;</Col>
        </Row>
        <Row>
            <Col>
                <Li><P>цвет;</P></Li>
            </Col>
            <Col><Em>Синий, голубой, сиреневый.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>вкус, запах;</P></Li>
            </Col>
            <Col><Em>Сладкий, пахучий, пряный.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>оценка;</P></Li>
            </Col>
            <Col><Em>Хороший, плохой.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>характер;</P></Li>
            </Col>
            <Col><Em>Добрый, скромный, смешливый.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>умственная и речевая деятельность.</P></Li>
            </Col>
            <Col><Em>Умный, глупый, говорливый.</Em></Col>
        </Row>
        <Row>
            <Col><Span className="table_razdel3">Б) Морфологические признаки</Span></Col>
            <Col><Span className="table_razdel3">Примеры</Span></Col>
        </Row>
        <Row>
            <Col>Те же, что и у имени существительного &ndash; род, число, падеж.{'\n'} Но в отличие от имён
                существительных, прилагательные изменяются по родам, числам, падежам, причём родовые различия
                наблюдаются у прилагательных только в форме единственного числа. Это связано с тем, что прилагательные
                обслуживают, поясняют имена существительные: прилагательные согласуются с существительными в роде, числе
                и падеже.</Col>
            <Col>Ср.: <Em>голубой ковёр, голубая лента, голубое блюдце &ndash; голубые ковры, голубые ленты, голубые
                    блюдца.</Em></Col>
        </Row>
        <Row>
            <Col><Span className="table_razdel3">В) Синтаксические признаки</Span></Col>
            <Col><Span className="table_razdel3">Примеры</Span></Col>
        </Row>
        <Row>
            <Col>В предложении прилагательные обычно бывают определениями или именной частью сказуемого.</Col>
            <Col>Ср.: <Em><Span className="wavyline">Весёлый</Span> <Span>клоун</Span>
                    рассмешил ребят; <Span>Клоун</Span> <Span className="uDouble">был
                        весёлым</Span>.</Em></Col>
        </Row>
        <Row>
            <Col>Прилагательные согласуются с существительными в роде, числе и падеже.</Col>
            <Col>Ср.: <Em><Span className="wavyline">Весёлый</Span> <Span>клоун</Span>
                    рассмешил ребят; <Span className="wavyline">Весёлая</Span> <Span
                       >шутка</Span> рассмешила ребят.</Em></Col>
        </Row>
        <Row>
            <Col>Прилагательные могут распространяться существительными и наречиями, образуя с ними словосочетания.</Col>
            <Col>Ср.: <Em>слабый от болезни, очень слабый.</Em></Col>
        </Row>
    </Table>
<P><Strong><Span className="number">2.</Span></Strong> По характеру лексического значения прилагательные делятся на три
    разряда:</P>
<P>А) качественные;{'\n'} Б) относительные;{'\n'} В) притяжательные.</P>
<P>А) Качественные прилагательные</P>
<P><Strong>Качественные прилагательные</Strong> обозначают раз&shy;личные качества предмета:</P>

    <Li>
        <P>величина: <Em>большой, крупный, маленький;</Em></P>
    </Li>
    <Li>
        <P>возраст: <Em>старый, молодой;</Em></P>
    </Li>
    <Li>
        <P>цвет: <Em>красный, синий;</Em></P>
    </Li>
    <Li>
        <P>вес: <Em>лёгкий, тяжёлый;</Em></P>
    </Li>
    <Li>
        <P>внешний вид: <Em>красивый, стройный;</Em></P>
    </Li>
    <Li>
        <P>внутренние качества: <Em>умный, строгий, ленивый.</Em></P>
    </Li>

<P>Характерными <Strong>грамматическими и словообразователь&shy;ными особенностями</Strong> качественных прилагательных
    являются:</P>

    <Li>
        <P>наличие степеней сравнения;</P>
        <Div className="primer">
            <P><Em>Большой &ndash; больше, самый большой; умный &ndash; умнее, умнейший.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>наличие полной и краткой формы;</P>
        <Div className="primer">
            <P><Em>Строгий &ndash; строг, старый &ndash; стар.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>способность сочетаться с наречиями степени;</P>
        <Div className="primer">
            <P><Em>Очень строгий, очень большой, очень умный.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>образуют наречия с суффиксами <Span className="litera">-о, -е, -и</Span>.</P>
        <Div className="primer">
            <P><Em>Умный &rarr; умно, блестящий &rarr; блестяще, зверский &rarr; зверски.</Em></P>
        </Div>
    </Li>

    <Table>
        <Row>
            <Col>Наиболее важными <Strong>морфологическими признаками</Strong> качественных прилагательных являются
                следующие:{'\n'}<Strong>наличие степеней сравнения и двух (полной и краткой) форм</Strong>.</Col>
        </Row>
    </Table>
<P>Однако не все качественные прилагательные обладают этими признаками:</P>

    <Li>
        <P>нет степеней сравнения у прилагательных типа <Em>босой, косой, слепой, хромой, мёртвый, женатый</Em>, потому
            что они выражают абсолютные качества, то есть такие качества, которые не поддаются сравнению (нельзя быть
            мёртвым в большей или в меньшей степени; нельзя быть женатым в большей или в меньшей степени);</P>
    </Li>
    <Li>
        <P>нет краткой формы у прилагательных типа <Em>деловой, дружеский, комический</Em>, поскольку по происхождению
            они являются относительными;</P>
    </Li>
    <Li>
        <P>нет степеней сравнения у относительных или притяжательных прилагательных в качественном значении.</P>
        <Div className="primer">
            <P>Ср.: <Em>золотой браслет</Em> (относительное прилагательное) &ndash; <Em>золотой характер</Em>
                (качественное значение); <Em>лисий хвост</Em> (притяжательное прилагательное) &ndash; <Em>у этого
                    человека лисий характер / лисья улыбка</Em> (качественное значение).</P>
        </Div>
    </Li>

<P>Б) Относительные прилагательные</P>
<P><Strong>Относительные прилагательные</Strong> обозначают признаки не непосредственно, а через отношение к:</P>

    <Li>
        <P>материалу: <Em>железный, деревянный, бумажный</Em>;</P>
    </Li>
    <Li>
        <P>месту: <Em>деревенский, городской, здешний</Em>;</P>
    </Li>
    <Li>
        <P>времени: <Em>вчерашний, осенний</Em>;</P>
    </Li>
    <Li>
        <P>действию: <Em>стиральный, подготовительный</Em>;</P>
    </Li>
    <Li>
        <P>назначению: <Em>спортивный</Em>;</P>
    </Li>
    <Li>
        <P>лицу: <Em>родительский</Em>;</P>
    </Li>
    <Li>
        <P>понятию: <Em>научный, философский</Em>;</P>
    </Li>
    <Li>
        <P>числу: <Em>двойной, тройной</Em>;</P>
    </Li>
    <P>и т.д.</P>

<P>Эти признаки не могут проявляться в большей или в меньшей степени.</P>
    <Table>
        <Row>
            <Col>В отличие от качественных прилагательных относительные прилагательные <Strong>не изменяются по степеням
                    сравнения и не имеют краткой формы</Strong>.</Col>
        </Row>
    </Table>
<P>Относительным прилагательным синонимичны падежные или предложно-падежные формы
    существительных.</P>
<Div className="primer">
    <P>Ср.: <Em>железный обруч &ndash; обруч из железа; волжский берег &ndash; берег Волги; спортивная обувь &ndash;
            обувь для занятий спортом.</Em></P>
</Div>
<P>В) Притяжательные прилагательные</P>
<P><Strong>Притяжательные прилагательные</Strong> обозначают признаки предмета по его принадлежности какому-нибудь
    человеку или животному.</P>
<Div className="primer">
    <P><Em>Отцов пиджак, мамин платок, лисий хвост, волчий след.</Em></P>
</Div>
<P>Эти прилагательные отвечают на вопрос <Span className="litera">чей? чья? чьё? чьи?</Span> Такие признаки также не могут
    быть у предмета в большей или в меньшей степени.</P>
    <Table>
        <Row>
            <Col>В отличие от качественных прилагательных притяжательные прилагательные, как и относительные, <Strong>не
                    изменяются по степеням сравнения</Strong>.</Col>
        </Row>
    </Table>
<P>Притяжательные прилагательные имеют суффиксы:</P>

    <Li>
        <P><Span className="litera">-ин/-ын</Span>: <Em>мамин, курицын, сестрицын</Em>;</P>
    </Li>
    <Li>
        <P><Span className="litera">-ов/-ев</Span>: <Em>отцов, дедов</Em>;</P>
    </Li>
    <Li>
        <P><Span className="litera">-ий/-j-</Span>: <Em>медвежий &ndash; медвеж</Em>[&nbsp;j&nbsp;]<Em>ьего</Em>.</P>
    </Li>

<Div className="alertText">Обратите внимание!</Div>
<Div className="alert"><P><Strong>1)</Strong> Притяжательные прилагательные с суффиксами <Span className="litera">-ин/ын, -ов/-ев,
        -ий/-j-</Span> в форме единственного числа именительного падежа в мужском роде обычно имеют нулевое окончание, а
    в женском и среднем родах &ndash; такие же окончания, как и существительные.</P>
    <Div className="primer">
        <P>Ср.: <Em>медвежий</Em><Span className="kwadrat">&#9633;</Span><Em>, медвежь<Span className="litera">я</Span>,
                медвежь<Span className="litera">е</Span></Em>.</P>
    </Div>
    <P><Strong>2)</Strong> При употреблении прилагательных их значение может меняться. Так, относительные прилагательные
        могут переходить в разряд качественных.</P>
    <Div className="primer">
        <P>Ср.: <Em>сиреневая ветка</Em> &ndash; относительное прилагательное; <Em>сиреневое платье</Em> &ndash;
            качественное прилагательное.</P>
    </Div>
    <P>Притяжательные прилагательные могут переходить в разряд относительных и качественных.</P>
    <Div className="primer"><P>Ср.: <Em>медвежий след</Em> (след принадлежит медведю) &ndash; притяжательное прилагательное;
        <Em>медвежья шуба</Em> (шуба сделана из шкуры медведя, а не принадлежит медведю) &ndash; относительное
        прилагательное; <Em>медвежья походка</Em> (походка как у медведя) &ndash; качественное прилагательное.</P></Div>
</Div></View>