import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../../tags";
import { Table, Col, Row } from "../../table";

export const stepeni_sravneniya = <View><P>Как отмечалось в 3.3.1, степени сравнения есть у большинства качественных прилагательных.</P>
<P>Прилагательные имеют две степени сравнения: <Strong>сравнительную и превосходную</Strong>.</P>
<P>Использование качественного прилагательного в отвлечении от степени его проявления называется
    <Strong>положительной</Strong> степенью.</P>
<Div className="primer">
    <P><Em>Красивый</Em> (положительная степень) &ndash; <Em>красивее</Em> (сравнительная степень) &ndash;
        <Em>красивейший</Em> (превос&shy;ходная степень).</P>
</Div>
<P>А) Сравнительная степень прилагательных</P>
<P><Strong><Span className="number">1.</Span></Strong> <Strong>Сравнительная степень прилагательного</Strong> обозначает,
    что какой-то признак проявляется в одном предмете в большей или меньшей степени, чем в другом.</P>
<Div className="primer">
    <P><Em>Он лучше меня; Он красивее меня; Твой портфель тяжелее, чем мой.</Em></P>
</Div>
<P><Strong><Span className="number">2.</Span></Strong> Сравнительная степень бывает <Strong>простая</Strong> и
    <Strong>сложная</Strong>.</P>

    <Li>
        <P><Strong>Простая сравнительная степень</Strong> образуется с помощью суффиксов:</P>
        
            <Li>
                <P><Span className="litera">-ее</Span> (<Span className="litera">-ей</Span>): <Em>красивый &ndash; красивее,
                        смелый &ndash; смелее, холодный &ndash; холоднее</Em>;</P>
            </Li>
            <Li>
                <P><Span className="litera">-е</Span> (с чередованием последнего согласного основы или без чередования):
                    <Em>большой &ndash; больше, короткий &ndash; короче, сладкий &ndash; слаще</Em>;</P>
            </Li>
            <Li>
                <P><Span className="litera">-ше</Span>: <Em>старый &ndash; старше, молодой &ndash; младше</Em>.</P>
            </Li>
        
        <P>Иногда при образовании сравнительной степени прилагательного используется другой корень.</P>
        <Div className="primer">
            <P><Em>Хороший &ndash; лучше, плохой &ndash; хуже, маленький &ndash; меньше.</Em></P>
        </Div>
    </Li>
        <Table>
            <Row>
                <Col>Прилагательные в форме простой сравнительной степени <Strong>не изменяются и не имеют
                        окончаний</Strong>!</Col>
            </Row>
        </Table>
    <Li>
        <P><Strong>Сложная сравнительная степень</Strong> образуется от полной формы
            положительной степени прилагательного с помощью частиц <Span className="litera">более</Span> и <Span
                className="litera">менее</Span>.</P>
        <Div className="primer">
            <P><Em>Большой &ndash; более/менее большой, красивый &ndash; более/менее красивый.</Em></P>
        </Div>
        <P>Сложная форма сравнительной степени, как и полная форма положительной степени прилагательных, изменяется по
            родам, числам и падежам.</P>
    </Li>

<P>Б) Превосходная степень прилагательных</P>
<P><Strong><Span className="number">1.</Span></Strong> <Strong>Превосходная степень</Strong> обозначает, что какой-то
    признак проявляется в одном предмете в наибольшей или наименьшей степени.</P>
<Div className="primer">
    <P><Em>Он мой <Span className="litera">лучший</Span> друг; Она <Span className="litera">самая красивая</Span> девочка в
            нашем классе.</Em></P>
</Div>
<P><Strong><Span className="number">2.</Span></Strong> Превосходная степень бывает <Strong>простая</Strong> и
    <Strong>сложная</Strong>.</P>

    <Li>
        <P><Strong>Простая превосходная степень</Strong> образуется с помощью суффиксов <Span className="litera">-ейш-,
                -айш-</Span>.</P>
        <Div className="primer">
            <P><Em>Красивый &ndash; красив<Span className="litera">ейш</Span>ий, мягкий &ndash; мягч<Span
                        className="litera">айш</Span>ий, добрый &ndash; добр<Span className="litera">ейш</Span>ий.</Em></P>
        </Div>
        <P>Иногда при образовании превосходной степени прилагательного используется другой корень.</P>
        <Div className="primer">
            <P><Em>Хороший &ndash; лучший, плохой &ndash; худший.</Em></P>
        </Div>
    </Li>
    <Li>
        <P><Strong>Сложная превосходная степень</Strong> образуется от полной формы положительной степени
            прилагательного с помощью частиц <Span className="litera">самый, наиболее</Span> и <Span
                className="litera">наименее</Span>.</P>
        <Div className="primer">
            <P><Em>Большой &ndash; самый/наиболее/наименее большой, красивый &ndash; самый/наиболее/наименее
                    красивый.</Em></P>
        </Div>
    </Li>

<P>Прилагательные в превосходной степени, как и полные формы положительной степени прилагательных, изменяются по родам,
    числам и падежам.</P>
<Div className="alertText">Обратите внимание!</Div>
<Div className="alert">
    <P>При образовании сравнительной и превосходной степени нельзя одновременно использовать простую и сложную форму
        степеней сравнения.{'\n'} <Strong>Неправильно:</Strong> <Em>более красивее, более тяжелее, наиболее
            спокойнейший</Em>.</P>
</Div></View>