import { Text, View } from "react-native";
import { Strong, P } from "./tags";

export const desc = {
  Phonetics: (
    <View>
      <P>
        <Strong>Фонетика</Strong> – раздел языкознания, изучающий звуковой строй
        языка.
      </P>
      <P>
        <Strong>Графика</Strong> – учение о совокупности знаков, с помощью
        которых устная речь передается на письме. Основными средствами графики
        являются буквы. К графическим знакам относятся также знак ударения,
        дефис (черточка), знаки препинания и др.
      </P>
    </View>
  ),
  Morphology: <P>Morphology</P>,
};
