import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../../tags";
import { Table, Col, Row } from "../../table";

export const ponyatie_ob_imeni = <View><P><Strong><Span className="number">1.</Span></Strong> <Strong>Имя существительное</Strong> &ndash; самостоятельная часть
    речи, которая обозначает предмет и отвечает на вопросы <Span className="litera">кто? что?</Span></P>
<P>Основные признаки имени существительного</P>

    <Table>
        <Row>
            <Col><Span>А) Общее грамматическое значение</Span></Col>
            <Col><Span>Примеры</Span></Col>
        </Row>
        <Row>
            <Col>Это значение предмета, то есть всего того, о чём можно сказать: <Em>это кто?</Em> или <Em>это что?</Em>
            </Col>
            <Col><Em>Весна, школа, стена, отдых.</Em></Col>
        </Row>
        <Row>
            <Col><Span>Б) Морфологические признаки</Span></Col>
            <Col><Span>Примеры</Span></Col>
        </Row>
        <Row>
            <Col>Это род, число, падеж, склонение.</Col>
            <Col>&nbsp;</Col>
        </Row>
        <Row>
            <Col><Strong>Имена существительные:</Strong></Col>
            <Col>&nbsp;</Col>
        </Row>
        <Row>
            <Col>
                <Li><P>принадлежат к одному из трёх родов &ndash; мужскому, женскому, среднему, но не изменяются по родам;</P>
                </Li>
            </Col>
            <Col><Em>Океан, река, море.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>изменяются по числам;</P></Li>
            </Col>
            <Col><Em>Океан &ndash; океаны, река &ndash; реки, море &ndash; моря.</Em></Col>
        </Row>
        <Row>
            <Col>
                <Li><P>изменяются по падежам.</P></Li>
            </Col>
            <Col><Em>Океан &ndash; океана, океану, океаном</Em> и др.</Col>
        </Row>
        <Row>
            <Col>Изменение по падежам и числам называется <Strong>склонением</Strong>. Начальная форма существительного
                &ndash; именительный падеж единственного числа.</Col>
            <Col>&nbsp;</Col>
        </Row>
        <Row>
            <Col><Span>В) Синтаксические признаки</Span></Col>
            <Col><Span>Примеры</Span></Col>
        </Row>
        <Row>
            <Col>В предложении существительные чаще всего бывают подлежащими или дополнениями.</Col>
            <Col>Ср.: <Em><Span style="text-decoration: underline;">Сестра</Span> <Span className="uDouble">подарила</Span>
                    <Span className="uDashed">брату книгу</Span>.</Em></Col>
        </Row>
        <Row>
            <Col>Существительное часто зависит от глагола и ставится при нём в определённом падеже.</Col>
            <Col>Ср.: <Em>обидеть друга, поссорить с другом, накричать на друга.</Em></Col>
        </Row>
        <Row>
            <Col>Существительные могут распространяться прилагательными и другими существительными в косвенном падеже.
            </Col>
            <Col>Ср.: <Em>школьное здание, здание школы.</Em></Col>
        </Row>
    </Table>
<P><Strong><Span className="number">2.</Span></Strong> По характеру лексического значения существительные делятся на два
    разряда:</P>

    <Li>
        <P><Strong>нарицательные существительные</Strong> называют класс однородных предметов;</P>
        <Div className="primer">
            <P><Em>Стол, мальчик, птица, весна.</Em></P>
        </Div>
    </Li>
    <Li>
        <P><Strong>собственные существительные</Strong> называют единичные (индивидуальные) предметы, к которым
            относятся имена, отчества, фамилии людей, клички животных, названия городов, рек, морей, океанов, озёр, гор,
            пустынь (географические названия), названия книг, картин, кинофильмов, журналов, газет, спектаклей, названия
            кораблей, поездов, различных организаций, исторических событий и т.п.</P>
        <Div className="primer">
            <P><Em>Александр, Жучка, Россия, Астрахань, Волга, Байкал, &laquo;Капитанская дочка&raquo;.</Em></P>
        </Div>
    </Li>

<Div className="alertText">Обратите внимание!</Div>
<Div className="alert"><P><Strong>1)</Strong> Имена собственные могут состоять из одного слова (<Em>Москва, Каспий, Кавказ,
        &laquo;Мцыри&raquo;</Em>) или из нескольких слов (<Em>Нижний Новгород, Новый Орлеан, Василий Андреевич
        Жуковский, &laquo;Война и мир&raquo;, Восточно-Сибирское море</Em>).
    <P><Strong>2)</Strong> Имена собственные пишутся с большой буквы (Тула, Альпы).</P>
    <Strong>3)</Strong> Названия (заглавия) книг, газет, журналов, кинофильмов, картин, кораблей, поездов и т.п. пишутся
    с большой буквы и, кроме того, выделяются кавычками (<Em>роман &laquo;Евгений Онегин&raquo;; картина &laquo;Утро в
        лесу&raquo;, теплоход &laquo;Василий Суриков&raquo;</Em>).</P>
</Div>
<P><Strong><Span className="number">3.</Span></Strong> По значению имена существительные делятся на четыре основных разряда:
</P>
<P>а) <Strong>конкретные</Strong> &ndash; называют конкретные предметы живой и неживой природы (изменяются по числам,
    сочетаются с количественными числительными).</P>
<Div className="primer">
    <P>Например: <Span className="litera">стол</Span> (<Em>столы, два стола</Em>), <Span className="litera">ученик</Span>
        (<Em>ученики, два ученика</Em>), <Span className="litera">гора</Span> (<Em>горы, две горы</Em>);</P>
</Div>
<P>б) <Strong>вещественные</Strong> &ndash; называют различные вещества, однородную массу чего-либо (имеют только одну
    форму числа &ndash; единственного или множественного; не сочетаются в количественными числительными; сочетаются со
    словами много, мало, а также с различными единицами измерения).</P>
<Div className="primer">
    <P>Например: <Span className="litera">воздух</Span> (нет множественного числа; нельзя сказать: <Em>два воздуха</Em>, но
        можно: <Em>много воздуха, мало воздуха; два кубометра воздуха</Em>), <Span className="litera">грязь</Span> (нет
        множественного числа; нельзя сказать: <Em>две грязи</Em>, но можно: <Em>много грязи, мало грязи; два килограмма
            грязи</Em>), <Span className="litera">чернила</Span> (нет единственного числа; нельзя сказать: <Em>пять
            чернил</Em>, но можно: <Em>много чернил, мало чернил, двести граммов чернил</Em>), <Span
            className="litera">опилки</Span> (нет единственного числа; нельзя сказать: <Em>пять опилок</Em>, но можно:
        <Em>много опилок, мало опилок; полкилограмма опилок</Em>);</P>
</Div>
<P>в) <Strong>отвлечённые</Strong> &ndash; называют абстрактные явления, воспринимаемые мысленно (имеют только
    единственное или только множественное число, не сочетаются с количественными числительными).</P>
<Div className="primer">
    <P>Например: <Span className="litera">сострадание</Span> (нет множественного числа; нельзя сказать: <Em>два
            сострадания</Em>), <Span className="litera">теплота</Span> (нет множественного числа; нельзя сказать: <Em>две
            теплоты</Em>), <Span className="litera">горечь</Span> (нет множественного числа; нельзя сказать: <Em>две
            горечи</Em>), <Span className="litera">хлопоты</Span> (нет единственного числа; нельзя сказать: <Em>пять
            хлопот</Em>);</P>
</Div>
<P>г) <Strong>собирательные</Strong> &ndash; называют множество одинаковых предметов как одно целое (имеют только форму
    единственного числа; не сочетаются с количественными числительными).</P>
<Div className="primer">
    <P>Например, <Span className="litera">молодёжь</Span> (нет множественного числа, хотя обозначает множество; нельзя
        сказать: <Em>две молодёжи</Em>), <Span className="litera">учительство</Span> (нет множественного числа, хотя
        обозначает множество; нельзя сказать: <Em>два учительства</Em>), <Span className="litera">зверьё</Span> (нет
        множественного числа, хотя обозначает множество; нельзя сказать: <Em>два зверья</Em>), <Span
            className="litera">листва</Span> (нет множественного числа, хотя обозначает множество; нельзя сказать: <Em>две
            листвы</Em>).</P>
</Div>
<P><Strong><Span className="number">4.</Span></Strong> По типу обозначаемых предметов существительные делятся на два
    разряда:</P>

    <Li>
        <P><Strong>одушевлённые</Strong> существительные называют предметы живой природы, к ним задаётся вопрос <Span
                className="litera">кто?</Span>;</P>
        <Div className="primer">
            <P><Em>Отец, мать, соловей, кошка, муха, червяк.</Em></P>
        </Div>
    </Li>
    <Li>
        <P><Strong>неодушевлённые</Strong> существительные называют предметы неживой природы, к ним задаётся вопрос
            <Span className="litera">что?</Span>.</P>
        <Div className="primer">
            <P><Em>Страна, камень, смех, снег, окно.</Em></P>
        </Div>
    </Li>

<Div className="alertText">Обратите внимание!</Div>
<Div className="alert"><P><Strong>1)</Strong> Одушевлёнными главным образом являются существительные мужского и женского родов.
    Одушевлённых существительных среднего рода очень мало (<Em>дитя, животное, лицо</Em> в значении
    &laquo;человек&raquo;, млекопитающее, <Em>насекомое, страшилище, существо</Em> в значении &laquo;живой
    организм&raquo;, <Em>чудовище</Em>).</P>
    <P><Strong>2)</Strong> Одушевлённые и неодушевлённые существительные имеют особенности в склонении.</P>
    <P>У одушевлённых существительных во множественном числе форма винительного падежа совпадает с формой родительного
        падежа (у одушевлённых существительных мужского рода 2-го склонения и в единственном числе).</P>
    <Div className="primer">
        <P>Ср.: <Em>мать &ndash; вижу матерей</Em> (мн.ч. В.п.), <Em>нет матерей</Em> (мн.ч. Р.п.); <Em>отец &ndash;
                вижу отцов</Em> (мн.ч. В.п.), <Em>нет отцов</Em> (мн.ч. Р.п.); <Em>вижу отца</Em> (ед.ч. В.п.), <Em>нет
                отца</Em> (ед.ч. Р.п.).</P>
    </Div>
    <P>У неодушевлённых существительных во множественном числе форма винительного падежа совпадает с формой
        именительного падежа (у существительных мужского рода 2-го склонения и в единственном числе форма винительного
        падежа совпадает с формой именительного падежа).</P>
    <Div className="primer">
        <P>Ср.: <Em>страна &ndash; вижу страны</Em> (мн.ч. В.п.), <Em>здесь есть страны</Em> (мн.ч. И.п.); <Em>камень
                &ndash; вижу камни</Em> (мн.ч. В.п.), <Em>здесь есть камни</Em> (мн.ч. И.п.); <Em>вижу камень</Em>
            (ед.ч. В.п.), <Em>здесь есть камень</Em> (ед.ч. И.п.).</P>
    </Div>
    <P><Strong>3)</Strong> Деление существительных на одушевлённые и неодушевлённые не всегда совпадает с научным
        представлением о живой и неживой природе.</P>
    <Div className="primer"><P>Например, существительное <Span className="litera">полк</Span> обозначает совокупность людей, но это
        неодушевлённое существительное (В.п. = И.п.: <Em>вижу полк</Em><Span>&#9633;</Span><Em> &ndash;
            здесь есть полк</Em><Span>&#9633;</Span>). То же самое можно наблюдать на примере
        существительного <Span className="litera">микроб</Span>. С точки зрения биологии, это часть живой природы, но
        существительное <Em>микроб</Em> неодушевлённое (В.п. = И.п.: <Em>вижу микроб</Em><Span
           >&#9633;</Span><Em> &ndash; здесь есть микроб</Em><Span>&#9633;</Span>).
        Существительные <Span className="litera">мертвец</Span> и <Span className="litera">труп</Span> являются синонимами, но
        существительное <Em>мертвец</Em> является одушевлённым (В.п. = Р.п.: <Em>вижу мертвеца &ndash; нет
            мертвеца</Em>), а существительное <Em>труп</Em> является неодушевлённым (В.п. = И.п.: <Em>вижу
            труп</Em><Span>&#9633;</Span><Em> &ndash; здесь есть труп</Em><Span
           >&#9633;</Span>).</P></Div>
</Div></View>