import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../tags";
import { Table, Col, Row } from "../table";

export const chasti_rechi = <View><P><Strong><Span className="number">1.</Span></Strong> Все слова русского языка можно разделить на группы, которые называют
    <Strong>частями речи</Strong>.</P>
    <Table>
        <Row>
            <Col><Strong>Морфология</Strong> &ndash; это раздел грамматики, в котором изучаются слова как части речи.
            </Col>
        </Row>
    </Table>
<P>Вместе с синтаксисом морфология составляет раздел науки о языке, называемый
    <Strong>грамматикой</Strong>.</P>
<P><Strong><Span className="number">2.</Span></Strong> Каждая часть речи имеет признаки, которые
    можно объединить в три группы:</P>
    <Table>
        <Row>
            <Col>Общее грамматическое значение:</Col>
            <Col>Морфологические признаки:</Col>
            <Col>Синтаксические признаки:</Col>
        </Row>
        <Row>
            <Col>значение, одинаковое для всех слов одной и той же части речи.</Col>
            <Col>род, число, падеж, время, лицо и др., а также склонение, спряжение или неизменяемость слова.</Col>
            <Col>свойство слов одной части речи быть определёнными членами предложения, особенности связи слов одной
                части речи с другими словами.</Col>
        </Row>
    </Table>
<P><Strong><Span className="number">3.</Span></Strong> Все части речи делятся на две группы
  &ndash; <Strong>самостоятельные (знаменательные)</Strong> и <Strong>служебные</Strong>. Особое положение в системе
    частей речи занимают междометия.</P>
<P><Strong><Span className="number">4.</Span></Strong> <Strong>Самостоятельные (знаменательные) части речи</Strong> включают
    слова, называющие предметы, их действия и признаки. К самостоятельным словам можно задать вопросы, а в предложении
    знаменательные слова являются членами предложения.</P>
<P><Strong>К самостоятельным частям речи в русском языке относятся следующие:</Strong></P>
    <Table>
        <Row>
            <Col>&nbsp;</Col>
            <Col>Часть речи</Col>
            <Col>Вопросы</Col>
            <Col>Примеры</Col>
        </Row>
        <Row>
            <Col><Strong>1</Strong></Col>
            <Col><Strong>Имя существительное</Strong></Col>
            <Col>кто? что?</Col>
            <Col><Em>Мальчик, дядя, стол, стена, окно.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>2</Strong></Col>
            <Col><Strong>Глагол</Strong></Col>
            <Col>что делать? что сделать?</Col>
            <Col><Em>Пилить, распилить, знать, узнать.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>3</Strong></Col>
            <Col><Strong>Имя прилагательное</Strong></Col>
            <Col>какой? чей?</Col>
            <Col><Em>Хороший, синий, мамин, дверной.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>4</Strong></Col>
            <Col><Strong>Имя числительное</Strong></Col>
            <Col>сколько? который?</Col>
            <Col><Em>Пять, пятеро, пятый.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>5</Strong></Col>
            <Col><Strong>Наречие</Strong></Col>
            <Col>как? когда? где? и др.</Col>
            <Col><Em>Весело, вчера, близко.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>6</Strong></Col>
            <Col><Strong>Местоимение</Strong></Col>
            <Col>кто? какой? сколько? как? и др.</Col>
            <Col><Em>Я, он, такой, мой, столько, так, там.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>7</Strong></Col>
            <Col><Strong>Причастие</Strong></Col>
            <Col>какой? (что делающий? что сделавший? и др.)</Col>
            <Col><Em>Мечтающий, мечтавший.</Em></Col>
        </Row>
        <Row>
            <Col><Strong>8</Strong></Col>
            <Col><Strong>Деепричастие</Strong></Col>
            <Col>как? (что делая? что сделав?)</Col>
            <Col><Em>Мечтая, решив.</Em></Col>
        </Row>
    </Table>
<P>{'\n'} <Span> </Span></P>
<P><Strong>Примечания.</Strong></P>
<P>1) Как уже отмечалось, в лингвистике нет единой точки зрения на положение в системе частей речи причастия и
    деепричастия. Одни исследователи относят их к самостоятельным частям речи, другие считают их особыми формами
    глагола. Причастие и деепричастие действительно занимают промежуточное положение между самостоятельными частями речи
    и формами глагола. В данном пособии мы придерживаемся точки зрения, отражённой, например, в учебнике: Бабайцева
    В.В., Чеснокова Л.Л. Русский язык. Теория. 5&ndash;9 классы. М., 2001.</P>
<P>2) В лингвистике нет единой точки зрения на состав такой части речи, как числительные. В частности, в
    &laquo;академической грамматике&raquo; принято рассматривать порядковые числительные как особый разряд
    прилагательных. Однако школьная традиция относит их к числительным. Этой позиции будем придерживаться и мы в
    настоящем пособии.</P>
<P>3) В разных пособиях по-разному характеризуется состав местоимений. В частности, слова <Em>там, туда, нигде</Em> и
    др. в одних школьных учебниках относят к наречиям, в других &ndash; к местоимениям. В данном пособии мы
    рассматриваем такие слова как местоимения, придерживаясь точки зрения, отражённой в &laquo;академической
    грамматике&raquo; и в учебнике: Бабайцева В.В., Чеснокова Л.Л. Русский язык. Теория. 5&ndash;9 классы. М., 2001.</P>
<P><Strong><Span className="number">5.</Span></Strong> <Strong>Служебные части речи</Strong> &ndash; это слова, которые не
    называют ни предметов, ни действий, ни признаков, а выражают только отношения между ними.</P>

    <Li>
        <P>К служебным словам нельзя поставить вопрос.</P>
    </Li>
    <Li>
        <P>Служебные слова не являются членами предложения.</P>
    </Li>
    <Li>
        <P>Служебные слова обслуживают самостоятельные слова, помогая им соединяться друг с другом в составе
            словосочетаний и предложений.</P>
    </Li>
    <Li>
        <P>К служебным частям речи в русском языке относятся следующие:</P>
    </Li>


    <Li>
        <P><Strong>предлог</Strong> (<Em>в, на, об, из, из-за</Em>);</P>
    </Li>
    <Li>
        <P><Strong>союз</Strong> (<Em>и, а, но, однако, потому что, чтобы, если</Em>);</P>
    </Li>
    <Li>
        <P><Strong>частица</Strong> (<Em>бы, ли, же, не, даже, именно, только</Em>).</P>
    </Li>

<P><Strong><Span className="number">6.</Span></Strong> <Strong>Междометия</Strong> занимают особое положение среди частей
    речи.</P>

    <Li>
        <P>Междометия не называют ни предметов, ни действий, ни признаков (как самостоятельные части речи), не выражают
            отношений между самостоятельными словами и не служат для связи слов (как служебные части речи).</P>
    </Li>
    <Li>
        <P>Междометия передают наши чувства. Для выражения изумления, восторга, страха и др., мы используем такие
            междометия, как <Em>ах, ох, ух</Em>; для выражения чувства холода &ndash; <Em>бр-р</Em>, для выражения
            страха или боли &ndash; <Em>ой</Em> и т.д.</P>
    </Li>

<P><Strong><Span className="number">7.</Span></Strong> Как отмечалось, одни слова в русском языке могут изменяться, другие
    &ndash; нет.</P>

    <Li>
        <P>К <Strong>неизменяемым</Strong> относятся все служебные части речи, междометия, а также такие знаменательные
            части речи, как:</P>
    </Li>


    <Li>
        <P>наречия (<Em>вперёд, всегда</Em>);</P>
    </Li>
    <Li>
        <P>деепричастия (<Em>уходя, уйдя, приняв</Em>).</P>
    </Li>


    <Li>
        <P>Не изменяются также некоторые:</P>
    </Li>


    <Li>
        <P>существительные (<Em>пальто, такси, жалюзи</Em>);</P>
    </Li>
    <Li>
        <P>прилагательные (<Em>пальто цвета <Span className="litera">беж</Span>, костюм цвета <Span
                    className="litera">электрик</Span></Em>);</P>
    </Li>
    <Li>
        <P>местоимения (<Em>тогда, там</Em>).</P>
    </Li>


    <Li>
        <P>Неизменяемые слова не имеют окончаний.</P>
    </Li>
    <Li><P>Если слово изменяется, оно имеет несколько форм.</P>
        <Div className="primer">
            <P>Ср.: <Em>стена, стены, стену</Em> и др.; <Em>мечтаю, мечтаешь, мечтает</Em> и др.</P>
        </Div>
    </Li>
    <Li>
        <P>Формы слова передают определённое грамматическое значение. При формообразовании лексическое значение слова
            сохраняется, а изменяется его грамматическое значение. В предложении изменяемые слова выступают в одной из
            своих форм.</P>
        <Div className="primer">
            <P><Em>Сестра подарила брату книгу</Em>. Форма слова <Em>сестра</Em> передает значение ед.ч., И.п.; форма
                слова <Em>подарила</Em> &ndash; значение прош. вр., ед.ч., ж.р.; форма слова <Em>брату</Em> &ndash;
                значение ед.ч., Д.п.; форма слова <Em>книгу</Em> &ndash; значение ед.ч., В.п.</P>
        </Div>
    </Li>
    <Li>
        <P>Формы слова образуются разными способами:</P>
    </Li>


    <Li>
        <P>с помощью <Strong>окончания</Strong>;</P>
        <Div className="primer">
            <P>Ср.: <Em>сестра &ndash; сестр<Span className="litera">ы</Span>; читал &ndash; читал<Span
                        className="litera">а</Span>.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>с помощью <Strong>окончания и предлога</Strong>;</P>
        <Div className="primer">
            <P><Em>Сестра &ndash; <Span className="litera">к</Span> сестре, <Span className="litera">у</Span> сестры, <Span
                        className="litera">с</Span> сестрой.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>с помощью <Strong>суффиксов</Strong>;</P>
        <Div className="primer">
            <P><Em>Читать &ndash; чита<Span className="litera">л</Span>; быстрый &ndash; быстр<Span
                        className="litera">ее</Span>.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>с помощью <Strong>вспомогательных слов</Strong>.</P>
        <Div className="primer">
            <P><Em>Читать &ndash; <Span className="litera">буду</Span> читать, читал <Span className="litera">бы</Span>, <Span
                        className="litera">пусть</Span> читает; быстрый &ndash; <Span className="litera">более</Span> быстрый,
                    <Span className="litera">самый</Span> быстрый.</Em></P>
        </Div>
    </Li>
</View>