import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../tags";
import { Table, Col, Row } from "../table";

export const slitnoe_i_defisnoe = <View><P><Strong>Слитное и дефисное написание сложных слов</Strong> включает несколько типов правил:</P>
<P>1) общие правила слитного и дефисного написания слов;{'\n'} 2) слитное и дефисное написание сложных
    существи&shy;тельных;{'\n'} 3) слитное и дефисное написание сложных прилагательных.</P>
<P>Слитное, дефисное и раздельное написание наречий и служебных частей речи имеет свою систему правил и будет
    рассмотрено при характеристике соответствующих частей речи.</P>
<P>2.14.1. Общие правила слитного и дефисного написания слов</P>
<P><Strong><Span className="number">1.</Span></Strong> <Strong>Пишутся слитно</Strong> сложные слова с элементами
    (независимо от их количества в слове): <Span className="litera">авто-, авиа-, аэро-, био-, библио-, вело-, гео-, гелио-,
        гидро-, графо-, зоо-, изо-, квази-, кино-, лже-, макро-, микро-, метео-, мото-, мульти-, нео-, палео-, поли-,
        псвевдо-, радио-, теле-, термо-, стерео-, фото-, фоно-, электро-</Span>.</P>
<Div className="primer">
    <P><Em>Автошкола, авиабилеты, автомотовелогонки, аэросани, библиография, велотрек, гелиотерапия, геополитика,
            гидроузел, зоомагазин, киноплёнка, лжепророк, радиоволны.</Em></P>
</Div>
<P><Strong>Исключения:</Strong></P>

    <Li>
        <P>сложные слова, вторая часть которых &ndash; имя собственное.</P>
        <Div className="primer">
            <P><Em>Лже-Иванов, лже-Анастасия, лже-Дмитрий</Em> (но истор.: <Em>Лжедмитрий</Em>), <Em>авиакомпания
                    &laquo;Аэро-Мехикан&raquo;, кино-Остап.</Em></P>
        </Div>
    </Li>


    <Li>
        <P>сложные слова с несколькими такими элементами, соединёнными союзом <Span className="litera">и</Span>.</P>
        <Div className="primer">
            <P><Em>Теле- и радиопрограмма, авто- и мотогонки.</Em></P>
        </Div>
    </Li>

<P><Strong><Span className="number">2.</Span></Strong> <Strong>Пишутся слитно</Strong> слова с иноязычными приставками:
    <Span className="litera">анти-, архи-, гипер-, интер-, инфра-, контр-, пан-, псевдо-, суб-, супер-, транс-, ультра-,
        экстра-</Span>.</P>
<Div className="primer">
    <P><Em>Антиисторический, архиважный, гиперурбанизм, интерпозиция, инфракрасный, контрнаступление, панамериканский,
            псевдорусский, субпродукты, супермодный, транссибирский, ультраправый, экстраординарный.</Em></P>
</Div>
<P><Strong>Исключения:</Strong></P>

    <Li>
        <P>слова с этими приставками и следующей за ними прописной буквой: <Em>Пан-Европа</Em>.</P>
    </Li>
    <Li>
        <P><Span className="litera">контр-адмирал, экстра-класс</Span>.</P>
    </Li>

<P><Strong><Span className="number">3.</Span></Strong> <Strong>Пишутся слитно</Strong> сложные слова с первой частью &ndash;
    числительным в родительном падеже (с суффиксами <Span className="litera">-и-, -у-, -ух-, -а-</Span> и др.).</P>
<Div className="primer">
    <P><Em>Сем<Span className="litera">и</Span>летка, дв<Span className="litera">ух</Span>дюймовка, дв<Span
                className="litera">у</Span>личный, сорок<Span className="litera">а</Span>летие, пят<Span
                className="litera">и</Span>кратно, тридцат<Span className="litera">и</Span>пят<Span
                className="litera">и</Span>летний, тр<Span className="litera">ёх</Span>килограммовый.</Em></P>
</Div>
<P><Strong><Span className="number">4.</Span></Strong> <Strong>Пишутся слитно</Strong> слова с первым элементом <Span
        className="litera">полу-, полутора-, четверть-</Span>.</P>
<Div className="primer">
    <P><Em>Полумеры, полуоткрытый, полушутя, полутораметровый, четвертьфинальный.</Em></P>
</Div>
<Div className="alertText">Обратите внимание!</Div>
<Div className="alert"><P>Сочетания, в состав которых входит слово <Span className="litera">половина</Span>, <Strong>пишутся
        раздельно</Strong>.</P>
    <Div className="primer">
        <P><Em>Трёх с половиной километровое расстояние</Em>.</P>
    </Div>
    <P><Strong>Исключения:</Strong> <Em>трёхсполовинный, четырёхсполовинный</Em>.</P>
</Div>
<P><Strong><Span className="number">5.</Span></Strong> Слова с первым элементом <Span className="litera">пол-</Span> пишутся:
</P>

    <Li>
        <P><Strong>слитно</Strong>, если вторая часть начинается с согласной, кроме согласной л;</P>
        <Div className="primer">
            <P><Em>Полмира, полдня, ползимы.</Em></P>
        </Div>
    </Li>
    <Li>
        <P><Strong>через дефис</Strong>, если вторая часть начинается с гласной, согласной <Span className="litera">л</Span>
            или с прописной буквы;</P>
        <Div className="primer">
            <P><Em>Пол-огурца, пол-лимона, пол-Москвы.</Em></P>
        </Div>
    </Li>
    <Li>
        <P><Strong>раздельно</Strong>, если компонент <Span className="litera">пол-</Span> отделён от существительного
            определением.</P>
        <Div className="primer">
            <P><Em>Пол засеянного поля, пол фруктового сада.</Em></P>
        </Div>
    </Li>

<P>2.14.2. Слитное и дефисное написание сложных существительных</P>
<P>А) Пишутся слитно:</P>
<P><Strong><Span className="number">1.</Span></Strong> сложные существительные, образованные с помощью соединительной
    гласной;</P>
<Div className="primer">
    <P><Em>Вод<Span className="litera">о</Span>воз, земл<Span className="litera">е</Span>делие.</Em></P>
</Div>
<P><Strong><Span className="number">2.</Span></Strong> сложносокращённые слова;</P>
<Div className="primer">
    <P><Em>Завкадрами, районо, вуз, втуз, завмаг, спецкор.</Em></P>
</Div>
<P><Strong><Span className="number">3.</Span></Strong> сложные существительные со второй частью <Span className="litera">град,
        город, метр</Span>;</P>
<Div className="primer">
    <P><Em>Волгоград, Белгород, вольтметр.</Em></P>
</Div>
<P><Strong><Span className="number">4.</Span></Strong> сложные существительные с первым элементом <Span
        className="litera">борт</Span>;</P>
<Div className="primer">
    <P><Em>Бортинженер, бортпроводница.</Em></P>
</Div>
<P><Strong><Span className="number">5.</Span></Strong> сложные существительные с первой глагольной частью в повелительном
    наклонении (с суффиксом <Span className="litera">-и</Span>).</P>
<Div className="primer">
    <P><Em>Держиморда, горицвет, вертихвостка.</Em></P>
</Div>
<P><Strong>Исключение:</Strong> <Span className="litera">перекати-поле</Span>;</P>
<P><Strong><Span className="number">6.</Span></Strong> некоторые сложные географические названия;</P>
<Div className="primer">
    <P><Em>Верхнеколымск, Новоржев.</Em></P>
</Div>
<P><Strong><Span className="number">7.</Span></Strong> сложные существительные, образованные от дефисных написаний,
    называющих народностей, племена, людей по роду занятий, интересам, месту жительства.</P>
<Div className="primer">
    <P>Ср.: <Em>Пуэрто-Рико &ndash; пуэрториканец, Нью-Йорк &ndash; ньюйоркцы, яхт-клуб &ndash; яхтклубовец,
            ку-клукс-клан &ndash; куклуксклановец</Em> (но соответствующие прилагательные пишутся через дефис:
        <Em>пуэрто-риканский, нью-йоркский</Em>).</P>
</Div>
<Div className="alertText">Обратите внимание!</Div>
<Div className="alert"><P><Strong>1)</Strong> Слова, сокращённые до первых букв, обычно пишутся прописными буквами (<Em>ООН,
        ГКО</Em>).
    <P><Strong>2)</Strong> Точки внутри сложносокращённых слов не ставятся: <Em>ФСБ, госуниверситет</Em>.</P>
    <Strong>3)</Strong> Если элементы <Em>зав-, зам-, пом-</Em> отделены от существительного прилагательным, то они
    пишутся раздельно и после них ставится точка: <Em>зам. генерального директора, пом. главного режиссёра</Em>.</P>
</Div>
<P>Б) Пишутся через дефис:</P>
<P><Strong><Span className="number">1.</Span></Strong> сложные существительные, образованные без соединительной гласной,
    каждая часть которых может употребляться как самостоятельное слово;</P>
<Div className="primer">
    <P><Em>Диван-кровать, кафе-закусочная, купля-продажа, генерал-полковник, премьер-министр, член-корреспондент,
            плащ-палатка, дизель-мотор, мотор-генератор, инженер-капитан, динамо-машина, стоп-кран, кран-балка,
            пила-рыба, лорд-канцлер.</Em></P>
</Div>
<P><Strong><Span className="number">2.</Span></Strong> составные названия политических партий, направлений, их сторонников;
</P>
<Div className="primer">
    <P><Em>Социал-демократия, социал-революционер.</Em></P>
</Div>
<P><Strong><Span className="number">3.</Span></Strong> составные названия единиц измерений;</P>
<Div className="primer">
    <P><Em>Человеко-день, грамм-молекула, киловатт-час, тонно-километр.</Em></P>
</Div>
<P><Strong>Исключения:</Strong> <Span className="litera">трудодень, трудочас</Span>.</P>
<P><Strong><Span className="number">4.</Span></Strong> сложные существительные, обозначающие промежуточные части света, и их
    эквиваленты с иноязычными элементами;</P>
<Div className="primer">
    <P><Em> Юго-запад, северо-восток, зюйд-вест, норд-ост.</Em></P>
</Div>
<P><Strong><Span className="number">5.</Span></Strong> сложные названия растений, городов и др., в состав которых входят
    частицы, предлоги и союзы;</P>
<Div className="primer">
    <P><Em>Любишь-не-любишь, иван-да-марья, Ростов-на-Дону, Комсомольск-на-Амуре.</Em></P>
</Div>
<P><Strong><Span className="number">6.</Span></Strong> сложные существительные, первый элемент которых имеет оценочное
    значение;</P>
<Div className="primer">
    <P><Em>Чудо-богатырь, паинька-мальчик, аника-воин, бой-баба, гоп-компания, жар-птица, ура-патриотизм,
            горе-спортсмен.</Em></P>
</Div>
<P><Strong><Span className="number">7.</Span></Strong> сложные существительные с иноязычными элементами: <Span
        className="litera">обер-, унтер-, лейб-, штаб-, вице-, экс-, блок-, пресс-, макси-, миди-, мини-</Span>.</P>
<Div className="primer">
    <P><Em>Обер-прокурор, унтер-офицер, штабс-капитан, штаб-квартира, лейб-гвардия, вице-премьер, экс-чемпион,
            блок-схема, пресс-центр, макси-пальто, миди-юбка, мини-платье.</Em></P>
</Div>
<P><Strong>Исключения:</Strong> <Span className="litera">блокпост, блокгауз, блокнот</Span>;</P>
<P><Strong><Span className="number">8.</Span></Strong> сложные научные термины, в состав которых входят названия букв
    (обычно греческого и латинского алфавита);</P>
<Div className="primer">
    <P><Em>Гамма-лучи, икс-лучи, альфа-измеритель.</Em></P>
</Div>
<P><Strong><Span className="number">9.</Span></Strong> составные фамилии и некоторые географические названия.</P>
<Div className="primer">
    <P><Em>Жолио-Кюри, Новиков-Прибой, Усть-Ишим, Йошкар-Ола, Ново-Архангельск, Лас-Вегас, Нью-Йорк.</Em></P>
</Div>
<P>2.14.3. Слитное и дефисное написание сложных прилагательных</P>
    <Table>
        <Row>
            <Col>Пишутся слитно</Col>
            <Col>Пишутся через дефис</Col>
        </Row>
        <Row>
            <Col><Strong>1.</Strong> Сложные прилагательные, образованные от слитно пишущихся сложных существительных,
                ср.: <Em>железобетон &rarr; железобетонный; паровоз &rarr; паровозный; микроволны &rarr;
                    микроволновый</Em>.</Col>
            <Col><Strong>1.</Strong> Сложные прилагательные, образованные от сложных существительных, пишущихся через
                дефис, ср.: <Em>юго-запад &rarr; юго-западный; унтер-офицер &rarr; унтер-офицерский; социал-демократ
                    &rarr; социал-демократический</Em>.</Col>
        </Row>
        <Row>
            <Col><Strong>2.</Strong> Сложные прилагательные, образованные от словосочетаний с подчинительной связью, то
                есть таких сочетаний, в которых есть главное и зависимое слово (от главного слова к зависимому слову
                можно задать вопрос), ср.: <Em>Древняя Русь &rarr; древнерусский; строить паровозы &rarr;
                    паровозостроительный; три года &rarr; трёхгодичный; три миллиметра &rarr; трёхмиллиметровый; лить
                    чугун &rarr; чугунолитейный; спеть скоро &rarr; скороспелый</Em>.</Col>
            <Col><Strong>2.</Strong> Сложные прилагательные, образованные от сочетаний с сочинительной связью (между
                словами, образующими такое сочетание, можно поставить сочинительные союзы <Span className="litera">и; но; не
                    только.., но и</Span>), или образованные от слов, обозначающих неоднородные признаки, ср.:
                <Em>русский <Span className="litera">и</Span> немецкий &rarr; русско-немецкий; беспроцентный, <Span
                        className="litera">но</Span> выигрышный &rarr; беспроцентно-выигрышный; <Span className="litera">не
                        только</Span> выпуклый, <Span className="litera">но и</Span> вогнутый &rarr; выпукло-вогнутый;
                    научный популярный журнал &rarr; научно-популярный журнал</Em>.</Col>
        </Row>
        <Row>
            <Col><Strong>3.</Strong> Сложные прилагательные, образованные путём сращения словосочетания (наречие +
                прилагательное / причастие) в одно слово. Как правило, это научно-технические термины и выражения,
                используемые в книжной речи, первая часть которых образуется из наречий: <Span className="litera">высоко,
                    низко, выше, ниже, глубоко, мелко, легко, тяжело, остро, плоско, широко, узко, сильно, слабо, тонко,
                    круто, крупно</Span>, ср.: <Em>высоковитаминный, высокообразованный, легкораненый, тяжелораненый,
                    сильнодействующий, малоизученный, скоропортящийся, нижеподписавшийся, вышеизложенный</Em>.</Col>
            <Col><Strong>3.</Strong> Сложные прилагательные, обозначающие оттенки цвета или другие качества (вкусовые,
                слуховые и др.) с оттенком, ср.: <Em>бело-красный, иссиня-чёрный, ярко-синий, светло-голубой,
                    горько-сладкий</Em> (сладкий с горечью), <Em>горько-солёный</Em> (солёный с горечью),
                <Em>раскатисто-громкий</Em> (громкий, даже переходящий в раскатистый), <Em>почтительно-вежливый</Em>
                (вежливый и при этом выражающий почтительность), <Em>смущённо-счастливый</Em> (счастливый с оттенком
                смущения).</Col>
        </Row>
        <Row>
            <Col><Strong>4.</Strong> Прилагательные, образованные от китайских, корейских, вьетнамских и других восточных
                фамилий (независимо от того, как пишутся эти имена и фамилии &ndash; слитно, раздельно, через дефис),
                ср.: <Em>Лао-цзы &rarr; лаодзыстский</Em>.</Col>
            <Col><Strong>4.</Strong> Сложные прилагательные, образованные от сочетания имени и фамилии или двух фамилий:
                <Em>вальтер-скоттовские романы, бойль-мариоттовский закон</Em>.</Col>
        </Row>
        <Row>
            <Col><Strong>5.</Strong> Прилагательные, образованные от иноязычной фамилии, которой предшествует служебное
                слово, ср.: <Em>де Бройль &rarr; дебройлевская теория</Em>.</Col>
            <Col><Strong>5.</Strong> Сложные прилагательные, входящие в состав некоторых географических названий,
                образованных от словосочетаний с подчинительной связью: <Em>Горно-Алтайская автономная область,
                    Восточно-Китайское море, Западно-Сибирская низменность, Военно-Грузинская дорога, Восточно-Сибирское
                    море</Em>.</Col>
        </Row>
        <Row>
            <Col><Strong>6.</Strong> Сложные прилагательные с первой частью на <Span className="litera">-ико</Span> (не
                иноязычной): <Em>великосветский, великорусский</Em>.</Col>
            <Col><Strong>6.</Strong> Сложные прилагательные с первой иноязычной частью на <Span
                    className="litera">-ико</Span>: <Em>лексико-грамматический, историко-архивный</Em>.</Col>
        </Row>
    </Table>
    <Div className="alertText">Обратите внимание!</Div>
    <Div className="alert">
        <P><Strong>1)</Strong> Следует различать термины и книжные слова, которые образованы путём сращения, от
            соответствующих сочетаний &laquo;наречие + прилагательное/причастие&raquo;, которые пишутся раздельно.</P>
        <Div className="primer">
            <P>Ср.: <Em>многообещающий студент</Em> (&laquo;весьма талантливый, перспективный&raquo;) &ndash;
                <Em>студент, много обещающий, но никогда не выполняющий своих обещаний</Em>.</P>
        </Div>
        <P>Слова в соответствующих словосочетаниях сохраняют свою самостоятельность: от прилагательного/причастия можно
            поставить вопрос к наречию; их можно поменять местами; каждое из этих слов может иметь при себе зависимые
            слова.</P>
        <Div className="primer">
            <P>Ср.: <Em>рабски покорный &ndash; покорный</Em> (как? насколько? в какой степени?) <Em>рабски &ndash;
                    почти рабски покорный; практически ценный &ndash; ценный</Em> (в каком отношении?)
                <Em>практически</Em>.</P>
        </Div>
        <P><Strong>2)</Strong> Написание многих сложных прилагательных обусловлено традицией.</P>
        <Div className="primer">
            <P>Ср.: <Em>народнохозяйственный &ndash; народно-освободительный; всемирно известный &ndash;
                    всемирно-исторический; индоевропейцы, индоевропейский &ndash; вест-индский &ndash; вестготы</Em>.
            </P>
        </Div>
    </Div></View>