import { View } from "react-native";
import { Strong, Span, P, Em, Li, Div } from "../../tags";
import { Table, Col, Row } from "../../table";

export const ponyatie_o_mestoimenii = <View><P><Strong><Span className="number">1.</Span></Strong> <Strong>Местоимение</Strong> &ndash; самостоятельная часть речи,
    которая указывает на предметы, признаки, количество, но не называет их.</P>

    <Li>
        <P>К местоимениям можно задать вопросы имён существительных (<Span className="litera">кто? что?</Span>), имён
            прилагательных (<Span className="litera">какой? чей?</Span>), числительных (<Span
                className="litera">сколько?</Span>), наречий (<Span className="litera">как? когда? где?</Span>).</P>
    </Li>

<P>Основные признаки местоимений</P>
<Table>
    <Row>
        <Col><Span>А) Общее грамматическое значение</Span></Col>
        <Col><Span>Примеры</Span></Col>
    </Row>
    <Row>
        <Col>Указание на предметы, признаки, количество без называния их.</Col>
        <Col><Em><Span className="litera">Он</Span> смеется, <Span className="litera">мой</Span> брат, <Span
                    className="litera">несколько</Span> карандашей, <Span className="litera">там</Span> весело.</Em></Col>
    </Row>
    <Row>
        <Col><Span>Б) Морфологические и синтаксические признаки</Span></Col>
        <Col>&nbsp;</Col>
    </Row>
    <Row>
        <Col>Чаще всего зависят от того, какую часть речи они заменяют в тексте. Местоимения почти не имеют своих
            особых морфологических и синтаксических признаков.</Col>
        <Col>&nbsp;</Col>
    </Row>
</Table>
<P><Strong><Span className="number">2.</Span> Разряды местоимений по соотношению с другими частями речи:</Strong></P>
<P><Strong>1.</Strong> <Strong>Местоимения-существительные</Strong> &ndash; <Span className="litera">я, ты, мы, вы, он, кто,
        что, кто-то, никто, себя</Span> и др.:</P>

    <Li>
        <P>указывают на предметы;</P>
    </Li>
    <Li>
        <P>отвечают на вопросы имён существительных (<Span className="litera">кто? что?</Span>);</P>
    </Li>
    <Li>
        <P>изменяются по падежам;</P>
    </Li>
    <Li>
        <P>связываются с другими словами в предложении, как имена существительные;</P>
    </Li>

<P><Strong>2.</Strong> <Strong>Местоимения-прилагательные</Strong> &ndash; <Span className="litera">мой, твой, наш, ваш,
        какой, какой-то, этот, тот</Span> и др.:</P>

    <Li>
        <P>указывают на признаки предметов;</P>
    </Li>
    <Li>
        <P>отвечают на вопросы имён прилагательных (<Span className="litera">какой? чей?</Span>);</P>
    </Li>
    <Li>
        <P>связываются с именами существительными, как имена прилагательные;</P>
    </Li>
    <Li><P>изменяются, как и прилагательные, по числам, родам (в единственном числе) и падежам.</P>
        <P>Местоимение <Span className="litera">который</Span> примыкает к местоимениям-прилагательным (оно изменяется по
            родам, числам и падежам), но, как порядковое числительное, указывает на порядок предметов при счёте (ср.:
            &ndash; <Em>Который час? &ndash; Пятый</Em>);</P>
    </Li>

<P><Strong>3.</Strong> <Strong>Местоимения-числительные</Strong> &ndash; <Span className="litera">сколько, столько,
        несколько</Span>:</P>

    <Li>
        <P>указывают на количество предметов;</P>
    </Li>
    <Li>
        <P>отвечают на вопрос (<Span className="litera">сколько?</Span>);</P>
    </Li>
    <Li>
        <P>связываются с существительными, как количественные числительные;</P>
    </Li>
    <Li>
        <P>обычно изменяются по падежам;</P>
    </Li>

<P><Strong>4.</Strong> <Strong>Местоимения-наречия</Strong> &ndash; <Span className="litera">так, там, потому, где,
        куда</Span> и др.:</P>

    <Li>
        <P>указывают на признаки действий;</P>
    </Li>
    <Li>
        <P>отвечают на вопросы наречий (<Span className="litera">как? куда? когда? где? почему? зачем?</Span>);</P>
    </Li>
    <Li>
        <P>не изменяются, как и наречия;</P>
    </Li>
    <Li>
        <P>связываются с глаголами так же, как и наречия.</P>
    </Li>

<P><Span><Strong>Примечания.</Strong> Традиционно местоимения-наречия исключаются из состава местоимений. В этом случае
        в состав местоимений включаются только те слова, которые соотносятся с именными частями речи (с
        существительными, прилагательными, числительными). Но поскольку местоименные наречия <Span className="litera">там,
            тогда</Span> и др., как и другие местоименные слова, не называют, а лишь указывают (в данном случае на
        признаки действий), мы рассматриваем их в составе местоимений как особую группу.</Span></P>
<P><Strong><Span className="number">3.</Span> Разряды местоимений по значению и грамматическим особенностям:</Strong></P>
<P><Strong>1.</Strong> <Strong>Личные местоимения</Strong>: <Span className="litera">я, ты, мы, вы, он</Span> (<Span
        className="litera">она, оно, они</Span>) &ndash; указывают на лица, которые участвуют в речи:</P>

    <Li>
        <P>это местоимения-существительные;</P>
    </Li>
    <Li>
        <P>постоянным морфологическим признаком для всех личных местоимений является лицо (<Span className="litera">я,
                мы</Span> &ndash; 1-е л.; <Span className="litera">ты, вы</Span> &ndash; 2-е л.; <Span
                className="litera">он</Span>
            (<Span className="litera">она, оно, они</Span>) &ndash; 3-е л.);</P>
    </Li>
    <Li>
        <P>постоянным морфологическим признаком личных местоимений 1-го и 2-го л. является число (<Span
                className="litera">я,
                ты</Span> &ndash; единственное число; <Span className="litera">мы, вы</Span> &ndash; множественное число);
        </P>
    </Li>
    <Li>
        <P>все личные местоимения изменяются по падежам, при этом изменяется не только окончание, но и всё слово (<Span
                className="litera">я &ndash; меня, ты &ndash; тебя, он &ndash; его</Span>);</P>
    </Li>
    <Li>
        <P>местоимение 3-го лица <Span className="litera">он</Span> изменяется по числам и родам (в единственном числе)
            &ndash;
            <Span className="litera">он, она, оно, они</Span>.
        </P>
    </Li>

<P><Strong>2.</Strong> <Strong>Возвратное местоимение</Strong> <Span className="litera">себя</Span> &ndash; обозначает, что
    действие, совершаемое кем-то, направлено на само действующее лицо:</P>

    <Li>
        <P>это местоимение-существительное;</P>
    </Li>
    <Li>
        <P>возвратное местоимение не имеет рода, лица, числа и формы именительного падежа;</P>
    </Li>
    <Li>
        <P>возвратное местоимение изменяется по падежам (<Span className="litera">себя, себе, собою</Span>).</P>
    </Li>

<P><Strong>3.</Strong> <Strong>Притяжательные местоимения</Strong>: <Span className="litera">мой, твой, наш, ваш,
        свой</Span> &ndash; указывают на признак предмета по его принадлежности:</P>

    <Li>
        <P>это местоимения-прилагательные;</P>
    </Li>
    <Li>
        <P>притяжательные местоимения изменяются по числам, родам (в единственном числе), падежам (<Span
                className="litera">мой, моя, моё, мои, моего</Span> и т.д.).</P>
    </Li>


    <Li>
        <P>При указании на принадлежность третьему лицу используются застывшие формы родительного падежа личных
            местоимений &ndash; <Span className="litera">его, её, их</Span>.</P>
    </Li>

<P><Strong>4.</Strong> <Strong>Вопросительные местоимения</Strong>: <Span className="litera">кто? что? какой? чей? который?
        сколько? где? когда? куда? откуда? зачем?</Span> и др. &ndash; употребляются в вопросительных предложениях:</P>

    <Li>
        <P><Span className="litera">кто? что?</Span> &ndash; местоимения-существительные; не имеют рода, лица, числа;
            изменяются по падежам (<Em>кто, кого, что, чего</Em> и т.д.);</P>
    </Li>
    <Li>
        <P><Span className="litera">какой? чей? который?</Span> &ndash; местоимения-прилагательные и изменяются по числам,
            родам (в единственном числе), падежам (<Em>какой, какая, какое, какие, какого</Em> и т.д.);</P>
    </Li>
    <Li>
        <P><Span className="litera">сколько?</Span> &ndash; местоимение-числительное; изменяется по падежам (<Em>сколько,
                скольких, скольким</Em> и т.д.);</P>
    </Li>
    <Li>
        <P><Span className="litera">где? когда? куда? откуда? зачем?</Span> и др. &ndash; местоименные наречия; неизменяемые
            слова.</P>
    </Li>

<P><Strong>5.</Strong> <Strong>Относительные местоимения</Strong> совпадают с вопросительными &ndash; <Span
        className="litera">кто, что, какой, чей, который, сколько, где, когда, куда, откуда, зачем</Span> и др., но
    употребляются не в роли вопросительных слов, а в роли союзных слов в придаточных предложениях:</P>
<Div className="primer">
    <P><Em>Я знаю, <Span className="litera">кто</Span> виноват в нашем провале; Я знаю, <Span className="litera">сколько</Span>
            усилий он потратил на выполнение этого задания; Я знаю, <Span className="litera">где</Span> спрятаны
            деньги.</Em></P>
</Div>

    <Li>
        <P>Морфологические и синтаксические характеристики относительных местоимений те же, что и у вопросительных
            местоимений.</P>
    </Li>

<P><Strong>6.</Strong> <Strong>Неопределённые местоимения</Strong>: <Span className="litera">некто, нечто, некий, какой-то,
        чей-нибудь, некоторый, несколько, сколько-либо, где-то, когда-либо, кое-куда, откуда-то, зачем-то</Span> и др.
    &ndash; указывают на неопределённые, неизвестные предметы, признаки, количество.</P>

    <Li>
        <P>Неопределённые местоимения образуются от вопросительных местоимений с помощью приставок <Span
                className="litera">не-, кое-</Span> и постфиксов <Span className="litera">-то, -либо, -нибудь</Span>:</P>
        <Div className="primer">
            <P><Em>кто &rarr; некто, кое-кто, кто-то, кто-нибудь, кто-либо, кто-то; сколько &rarr; несколько,
                    сколько-то, сколько-нибудь; где &rarr; кое-где, где-то, где-либо, где-нибудь.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>Морфологические и синтаксические характеристики неопределённых местоимений те же, что и у вопросительных
            местоимений, от которых неопределённые местоимения образованы.</P>
    </Li>

<P><Strong>7.</Strong> <Strong>Отрицательные местоимения</Strong>: <Span className="litera">никто, ничто, никакой, ничей,
        нисколько, негде, никогда, ниоткуда, незачем</Span> и др. &ndash; указывают на отсутствие предметов, признаков,
    количества.</P>

    <Li>
        <P>Отрицательные местоимения образуются от вопросительных местоимений с помощью приставок <Span
                className="litera">не-, ни-</Span>:</P>
        <Div className="primer">
            <P><Em> кто &rarr; никто, сколько &rarr; нисколько, где &rarr; негде, когда &rarr; никогда.</Em></P>
        </Div>
    </Li>
    <Li>
        <P>Морфологические и синтаксические характеристики отрицательных местоимений те же, что и у вопросительных
            местоимений, от которых отрицательные местоимения образованы.</P>
    </Li>

<P><Strong>8.</Strong> <Strong>Указательные местоимения</Strong>: <Span className="litera">тот, этот, сей, оный, такой,
        столько, там, тут, здесь, туда, сюда, оттуда, отсюда, тогда, поэтому, затем</Span> и др. &ndash; являются
    средством указания на определённые предметы, признаки, количество (с различением одного от другого):</P>

    <Li>
        <P><Span className="litera">тот, этот, сей, оный, такой</Span> &ndash; местоимения-прилагательные и изменяются по
            числам, родам (в единственном числе), падежам (<Em>тот, та, то, те; такой, такая, такое, такие</Em> и т.д.);
        </P>
    </Li>
    <Li>
        <P><Span className="litera">столько</Span> &ndash; местоимение-числительное; изменяется по падежам (<Em>столько,
                стольких, стольким</Em> и т.д.);</P>
    </Li>
    <Li>
        <P><Span className="litera">там, тут, здесь, туда, сюда, оттуда, отсюда, тогда, поэтому, затем</Span> и др. &ndash;
            местоименные наречия; неизменяемые слова.</P>
    </Li>

<P><Strong>9.</Strong> <Strong>Определительные местоимения</Strong>: <Span className="litera">сам, самый, весь, всякий,
        каждый, иной, другой, любой, всюду, везде, всегда</Span> и др. &ndash; служат средством уточнения того предмета,
    признака, о котором идёт речь:</P>

    <Li>
        <P><Span className="litera">сам, самый, весь, всякий, каждый, иной, другой, любой</Span> &ndash;
            местоимения-прилагательные и изменяются по числам, родам (в единственном числе), падежам (<Em>всякий,
                всякая,
                всякое, всякие, всякого</Em> и т.д.);</P>
    </Li>
    <Li>
        <P><Span className="litera">всюду, везде, всегда</Span> &ndash; местоименные наречия; неизменяемые слова.</P>
    </Li>

<Div className="alertText">Обратите внимание!</Div>
<Div className="alert">
    <P><Strong>1)</Strong> Местоимения <Span className="litera">тот, сам</Span>, местоимения <Span className="litera">этот,
            весь</Span> в форме единственного числа, среднего рода (<Span className="litera">это,
            всё</Span>) и некоторые другие в определённых контекстах могут выступать в роли местоимений-существительных,
        подобно субстантивированным прилагательным (<Em><Span className="litera">Тот</Span> нам уже <Span
                className="uDouble">не опасен</Span>; <Span className="litera">Сам</Span> <Span
                className="uDouble">придёт</Span>; <Span className="litera">Это</Span><Span
                className="uDouble">книга</Span>; <Span className="litera">Всё</Span> <Span
                className="uDouble">закончилось</Span> хорошо</Em>).{'\n'}{'\n'} <Strong>2)</Strong> Некоторые местоимения
        имеют
        омонимы среди служебных частей речи (<Span className="litera">это, что, как, когда</Span>): <Span
            className="litera">Это</Span> <Em>книга</Em> (местоимение). &ndash; <Em>Москва &ndash; <Span
                className="litera">это</Span> столица России</Em> (указательная частица); <Em>Я знаю, <Span
                className="litera">что</Span> ему сказать</Em> (местоимение). &ndash; <Em>Я знаю, <Span
                className="litera">что</Span> он здесь</Em> (союз).</P>
</Div></View>